#pragma once

// Pubg Mobile Battelgrounds (2.7.0-64BIT) SDK Generated By @hhamk2 
// 𝚃𝚎𝚕𝚎𝚐𝚛𝚊𝚖 -: @SANSERO_MOD_1
namespace SDK
{
//---------------------------------------------------------------------------
//Enums
//---------------------------------------------------------------------------

// Enum AI.EAISoundCollectType
enum class EAISoundCollectType : uint8_t
{
	EAISoundCollectType__AISoundCollectType_Step = 0,
	EAISoundCollectType__AISoundCollectType_Weapon = 1,
	EAISoundCollectType__AISoundCollectType_Vehicle = 2,
	EAISoundCollectType__AISoundCollectType_Horn = 3,
	EAISoundCollectType__AISoundCollectType_Grenade = 4,
	EAISoundCollectType__AISoundCollectType_MAX = 5
};


// Enum AI.ECustomDamageEventReactionType
enum class ECustomDamageEventReactionType : uint8_t
{
	ECustomDamageEventReactionType__SpawnActor = 0,
	ECustomDamageEventReactionType__ActiveParticles = 1,
	ECustomDamageEventReactionType__DetactiveParticles = 2,
	ECustomDamageEventReactionType__HideMesh = 3,
	ECustomDamageEventReactionType__HideMeshInstance = 4,
	ECustomDamageEventReactionType__HideBone = 5,
	ECustomDamageEventReactionType__ApplyPhysicalAnimationProfile = 6,
	ECustomDamageEventReactionType__SetCollisionEnabled = 7,
	ECustomDamageEventReactionType__ECustomDamageEventReactionType_MAX = 8
};


// Enum AI.ECustomDamageEventTriggerType
enum class ECustomDamageEventTriggerType : uint8_t
{
	ECustomDamageEventTriggerType__OnPassedDamageThreshold = 0,
	ECustomDamageEventTriggerType__OnAnyDamage = 1,
	ECustomDamageEventTriggerType__ECustomDamageEventTriggerType_MAX = 2
};


// Enum AI.ENearItemType
enum class ENearItemType : uint8_t
{
	ENearItemType__Box             = 0,
	ENearItemType__Item            = 1,
	ENearItemType__AirDropBox      = 2,
	ENearItemType__TreasureChest   = 3,
	ENearItemType__Weed            = 4,
	ENearItemType__ENearItemType_MAX = 5
};



//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// ScriptStruct AI.ChildDynamicItem
// 0x0020
struct FChildDynamicItem
{
	int                                                Category;                                                 // 0x0000(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0004(0x0004) MISSED OFFSET
	struct FString                                     ChildName;                                                // 0x0008(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0018(0x0008) MISSED OFFSET
};

// ScriptStruct AI.AIStateInfoBase
// 0x0010
struct FAIStateInfoBase
{
	TArray<struct FString>                             IgnoreNames;                                              // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIStateXYZ
// 0x0010 (0x0020 - 0x0010)
struct FAIStateXYZ : public FAIStateInfoBase
{
	float                                              X;                                                        // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Y;                                                        // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Z;                                                        // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.SoundState
// 0x0030 (0x0040 - 0x0010)
struct FSoundState : public FAIStateInfoBase
{
	int                                                Type;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Location;                                                 // 0x0018(0x0020)
	uint32_t                                           ID;                                                       // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.CacheSoundState
// 0x0048
struct FCacheSoundState
{
	struct FSoundState                                 SoundState;                                               // 0x0000(0x0040)
	float                                              Time;                                                     // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET
};

// ScriptStruct AI.UniqueStateInfo
// 0x0008 (0x0018 - 0x0010)
struct FUniqueStateInfo : public FAIStateInfoBase
{
	uint64_t                                           diff_mark_id;                                             // 0x0010(0x0008) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIAttribute
// 0x0008 (0x0020 - 0x0018)
struct FAIAttribute : public FUniqueStateInfo
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Value;                                                    // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIPlayerState
// 0x0100 (0x0110 - 0x0010)
struct FAIPlayerState : public FAIStateInfoBase
{
	uint32_t                                           ID;                                                       // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	uint64_t                                           unique_id;                                                // 0x0018(0x0008) (ZeroConstructor, IsPlainOldData)
	int                                                expect_delivery_num;                                      // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                remain_delivery_num;                                      // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           actor_id;                                                 // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                team_id;                                                  // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0030(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0050(0x0020)
	struct FAIStateXYZ                                 Speed;                                                    // 0x0070(0x0020)
	float                                              HP;                                                       // 0x0090(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Energy;                                                   // 0x0094(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              dying_hp;                                                 // 0x0098(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              oxygen;                                                   // 0x009C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                active_weapon_slot;                                       // 0x00A0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                weapon_status;                                            // 0x00A4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_switching;                                             // 0x00A8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x00A9(0x0003) MISSED OFFSET
	int                                                alive_state;                                              // 0x00AC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                kill_count;                                               // 0x00B0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Damages;                                                  // 0x00B4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_running;                                               // 0x00B8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_aiming;                                                // 0x00B9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_left_probe;                                            // 0x00BA(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_right_probe;                                           // 0x00BB(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_floating;                                              // 0x00BC(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_diving;                                                // 0x00BD(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_vehicle_probe;                                         // 0x00BE(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_in_vehicle;                                            // 0x00BF(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_firing;                                                // 0x00C0(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_using_skill;                                           // 0x00C1(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x00C2(0x0002) MISSED OFFSET
	int                                                using_skill_id;                                           // 0x00C4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_holding;                                               // 0x00C8(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_stun;                                                  // 0x00C9(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_pose_acting;                                           // 0x00CA(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_picking;                                               // 0x00CB(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_weapon_near_wall;                                      // 0x00CC(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x00CD(0x0003) MISSED OFFSET
	int                                                body_state;                                               // 0x00D0(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                location_state;                                           // 0x00D4(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               has_smoke;                                                // 0x00D8(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x3];                                       // 0x00D9(0x0003) MISSED OFFSET
	int                                                vehicle_role;                                             // 0x00DC(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                player_type;                                              // 0x00E0(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               in_delivery_pool;                                         // 0x00E4(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x00E5(0x0003) MISSED OFFSET
	int                                                ai_level;                                                 // 0x00E8(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_move_has_collision;                                    // 0x00EC(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_lost_connection;                                       // 0x00ED(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x2];                                       // 0x00EE(0x0002) MISSED OFFSET
	int                                                revival_count;                                            // 0x00F0(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              rating_score;                                             // 0x00F4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              real_hidden_score;                                        // 0x00F8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData07[0x4];                                       // 0x00FC(0x0004) MISSED OFFSET
	TArray<struct FAIAttribute>                        Attributes;                                               // 0x0100(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIHeardSound
// 0x0010
struct FAIHeardSound
{
	TArray<struct FSoundState>                         heard_sound;                                              // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIDamageSources
// 0x0030 (0x0040 - 0x0010)
struct FAIDamageSources : public FAIStateInfoBase
{
	TArray<struct FAIStateXYZ>                         damage_source;                                            // 0x0010(0x0010) (ZeroConstructor)
	TArray<int>                                        damage_type;                                              // 0x0020(0x0010) (ZeroConstructor)
	TArray<int>                                        damage_weapon_type;                                       // 0x0030(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIDamageInfo
// 0x0018 (0x0028 - 0x0010)
struct FAIDamageInfo : public FAIStateInfoBase
{
	uint32_t                                           PlayerKey;                                                // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Damage;                                                   // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_type;                                              // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_weapon_type;                                       // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           damage_part;                                              // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              damage_before_cal_armor;                                  // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIPlayerInteractInfo
// 0x0030 (0x0040 - 0x0010)
struct FAIPlayerInteractInfo : public FAIStateInfoBase
{
	TArray<struct FAIDamageInfo>                       active_damage;                                            // 0x0010(0x0010) (ZeroConstructor)
	TArray<struct FAIDamageInfo>                       passive_damage;                                           // 0x0020(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   kill_list;                                                // 0x0030(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.CameraState
// 0x0060 (0x0070 - 0x0010)
struct FCameraState : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 Position;                                                 // 0x0010(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0030(0x0020)
	struct FAIStateXYZ                                 view_position;                                            // 0x0050(0x0020)
};

// ScriptStruct AI.AIWeaponStateInfo
// 0x0028 (0x0040 - 0x0018)
struct FAIWeaponStateInfo : public FUniqueStateInfo
{
	int                                                slot_id;                                                  // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Type;                                                     // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Bullet;                                                   // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                bullet_in_backpak;                                        // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              remain_reloading;                                         // 0x002C(0x0004) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        attachments;                                              // 0x0030(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIPlayerWeapon
// 0x0010
struct FAIPlayerWeapon
{
	TArray<struct FAIWeaponStateInfo>                  player_weapon;                                            // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIBackpackItem
// 0x0010 (0x0028 - 0x0018)
struct FAIBackpackItem : public FUniqueStateInfo
{
	int                                                Category;                                                 // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ID;                                                       // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Count;                                                    // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIPlayerBackpack
// 0x0010
struct FAIPlayerBackpack
{
	TArray<struct FAIBackpackItem>                     backpack_item;                                            // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIEquipmentInfo
// 0x0010 (0x0028 - 0x0018)
struct FAIEquipmentInfo : public FUniqueStateInfo
{
	int                                                Category;                                                 // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ID;                                                       // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Durability;                                               // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIPlayerEquipment
// 0x0010
struct FAIPlayerEquipment
{
	TArray<struct FAIEquipmentInfo>                    equipment_item;                                           // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffStateInfoBase
// 0x0010
struct FDiffStateInfoBase
{
	TArray<struct FString>                             IgnoreNames;                                              // 0x0000(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.ProgressBarState
// 0x0010 (0x0020 - 0x0010)
struct FProgressBarState : public FDiffStateInfoBase
{
	int                                                Type;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              remain_time;                                              // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           targetid;                                                 // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AINearbyPlayer
// 0x0130 (0x0148 - 0x0018)
struct FAINearbyPlayer : public FUniqueStateInfo
{
	struct FAIPlayerState                              State;                                                    // 0x0018(0x0110)
	struct FAIPlayerWeapon                             Weapon;                                                   // 0x0128(0x0010)
	struct FAIPlayerEquipment                          equipment;                                                // 0x0138(0x0010)
};

// ScriptStruct AI.ItemStateData
// 0x0040 (0x0058 - 0x0018)
struct FItemStateData : public FUniqueStateInfo
{
	int                                                Type;                                                     // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                ID;                                                       // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                UID;                                                      // 0x0024(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Durability;                                               // 0x0028(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Position;                                                 // 0x0030(0x0020)
	uint32_t                                           player_id;                                                // 0x0050(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0054(0x0004) MISSED OFFSET
};

// ScriptStruct AI.ObstacleState
// 0x0050 (0x0060 - 0x0010)
struct FObstacleState : public FAIStateInfoBase
{
	int                                                Type;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Category;                                                 // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              HP;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              max_hp;                                                   // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0020(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0040(0x0020)
};

// ScriptStruct AI.AINearbyThrown
// 0x0040 (0x0050 - 0x0010)
struct FAINearbyThrown : public FDiffStateInfoBase
{
	int                                                Type;                                                     // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Position;                                                 // 0x0018(0x0020)
	float                                              remain_time;                                              // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              explode_time;                                             // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_own;                                                   // 0x0040(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_held;                                                  // 0x0041(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x2];                                       // 0x0042(0x0002) MISSED OFFSET
	uint32_t                                           actorid;                                                  // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           sourceid;                                                 // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DoorState
// 0x0048 (0x0060 - 0x0018)
struct FDoorState : public FUniqueStateInfo
{
	struct FAIStateXYZ                                 Position;                                                 // 0x0018(0x0020)
	int                                                State;                                                    // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           ID;                                                       // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0040(0x0020)
};

// ScriptStruct AI.AIPlayerHitInfo
// 0x0018 (0x0028 - 0x0010)
struct FAIPlayerHitInfo : public FAIStateInfoBase
{
	int                                                fire_count;                                               // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_count;                                                // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_head_count;                                           // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_count_filter;                                         // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                hit_head_filter;                                          // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct AI.SafetyAreaState
// 0x0060 (0x0070 - 0x0010)
struct FSafetyAreaState : public FAIStateInfoBase
{
	int                                                State;                                                    // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0014(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Center;                                                   // 0x0018(0x0020)
	float                                              Radius;                                                   // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 next_center;                                              // 0x0040(0x0020)
	float                                              next_radius;                                              // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Time;                                                     // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                total_time;                                               // 0x0068(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                circle_index;                                             // 0x006C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.RedZoneState
// 0x0030 (0x0040 - 0x0010)
struct FRedZoneState : public FAIStateInfoBase
{
	struct FAIStateXYZ                                 Center;                                                   // 0x0010(0x0020)
	float                                              Radius;                                                   // 0x0030(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              remain_time;                                              // 0x0034(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              start_time;                                               // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIGameState
// 0x0028 (0x0038 - 0x0010)
struct FAIGameState : public FAIStateInfoBase
{
	bool                                               is_over;                                                  // 0x0010(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0011(0x0003) MISSED OFFSET
	int                                                alive_player_count;                                       // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Stage;                                                    // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           mode_map;                                                 // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           mode_type;                                                // 0x0020(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	struct FString                                     game_ds_version;                                          // 0x0028(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.VehicleDamageInfo
// 0x0018 (0x0028 - 0x0010)
struct FVehicleDamageInfo : public FAIStateInfoBase
{
	uint32_t                                           vehicle_id;                                               // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           PlayerKey;                                                // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              Damage;                                                   // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                damage_type;                                              // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_kill;                                                  // 0x0020(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0021(0x0007) MISSED OFFSET
};

// ScriptStruct AI.VehicleState
// 0x0120 (0x0138 - 0x0018)
struct FVehicleState : public FUniqueStateInfo
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Position;                                                 // 0x0020(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0040(0x0020)
	float                                              HP;                                                       // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              gas;                                                      // 0x0064(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Speed;                                                    // 0x0068(0x0020)
	uint32_t                                           damaged_num;                                              // 0x0088(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           Category;                                                 // 0x008C(0x0004) (ZeroConstructor, IsPlainOldData)
	bool                                               is_reverse;                                               // 0x0090(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               has_player;                                               // 0x0091(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_full;                                                  // 0x0092(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x5];                                       // 0x0093(0x0005) MISSED OFFSET
	struct FCameraState                                Camera;                                                   // 0x0098(0x0070)
	int                                                location_state;                                           // 0x0108(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x010C(0x0004) MISSED OFFSET
	TArray<float>                                      wheels_hp;                                                // 0x0110(0x0010) (ZeroConstructor)
	TArray<struct FVehicleDamageInfo>                  damage_info;                                              // 0x0120(0x0010) (ZeroConstructor)
	bool                                               is_has_collision;                                         // 0x0130(0x0001) (ZeroConstructor, IsPlainOldData)
	bool                                               is_using_horn;                                            // 0x0131(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x6];                                       // 0x0132(0x0006) MISSED OFFSET
};

// ScriptStruct AI.AIBulletHoles
// 0x0020 (0x0030 - 0x0010)
struct FAIBulletHoles : public FAIStateInfoBase
{
	TArray<struct FAIStateXYZ>                         hole_pos;                                                 // 0x0010(0x0010) (ZeroConstructor)
	TArray<struct FAIStateXYZ>                         hole_source_pos;                                          // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.AIRecipients
// 0x0030 (0x0040 - 0x0010)
struct FAIRecipients : public FAIStateInfoBase
{
	uint32_t                                           ID;                                                       // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           team_id;                                                  // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Position;                                                 // 0x0018(0x0020)
	float                                              HP;                                                       // 0x0038(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           Type;                                                     // 0x003C(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.SpecialZoneState
// 0x0078 (0x0090 - 0x0018)
struct FSpecialZoneState : public FUniqueStateInfo
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Center;                                                   // 0x0020(0x0020)
	float                                              Radius;                                                   // 0x0040(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           Type;                                                     // 0x0044(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                custom_state;                                             // 0x0048(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x004C(0x0004) MISSED OFFSET
	struct FAIStateXYZ                                 Position;                                                 // 0x0050(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0070(0x0020)
};

// ScriptStruct AI.DynamicItem
// 0x0050 (0x0068 - 0x0018)
struct FDynamicItem : public FUniqueStateInfo
{
	int                                                Category;                                                 // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           ID;                                                       // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FAIStateXYZ                                 Center;                                                   // 0x0020(0x0020)
	struct FAIStateXYZ                                 Rotation;                                                 // 0x0040(0x0020)
	float                                              Durability;                                               // 0x0060(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
};

// ScriptStruct AI.AIStateConfig
// 0x0008 (0x0018 - 0x0010)
struct FAIStateConfig : public FAIStateInfoBase
{
	int                                                Level;                                                    // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	int                                                Style;                                                    // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.AIStateInfo
// 0x0590 (0x05A8 - 0x0018)
struct FAIStateInfo : public FUniqueStateInfo
{
	struct FAIPlayerState                              State;                                                    // 0x0018(0x0110)
	struct FAIHeardSound                               Sound;                                                    // 0x0128(0x0010)
	struct FAIDamageSources                            damage_sources;                                           // 0x0138(0x0040)
	struct FAIPlayerInteractInfo                       player_interact_info;                                     // 0x0178(0x0040)
	struct FCameraState                                Camera;                                                   // 0x01B8(0x0070)
	struct FAIPlayerWeapon                             Weapon;                                                   // 0x0228(0x0010)
	struct FAIPlayerBackpack                           BackPack;                                                 // 0x0238(0x0010)
	struct FAIPlayerEquipment                          equipment;                                                // 0x0248(0x0010)
	struct FProgressBarState                           progress_bar;                                             // 0x0258(0x0020)
	TArray<struct FAINearbyPlayer>                     nearby_player;                                            // 0x0278(0x0010) (ZeroConstructor)
	TArray<struct FItemStateData>                      nearby_item;                                              // 0x0288(0x0010) (ZeroConstructor)
	TArray<struct FObstacleState>                      nearby_obstacle;                                          // 0x0298(0x0010) (ZeroConstructor)
	TArray<struct FAINearbyThrown>                     nearby_thrown;                                            // 0x02A8(0x0010) (ZeroConstructor)
	TArray<struct FDoorState>                          nearby_door;                                              // 0x02B8(0x0010) (ZeroConstructor)
	struct FAIPlayerHitInfo                            player_hit_info;                                          // 0x02C8(0x0028)
	struct FSafetyAreaState                            safety_area;                                              // 0x02F0(0x0070)
	struct FRedZoneState                               red_zone;                                                 // 0x0360(0x0040)
	struct FAIGameState                                Game;                                                     // 0x03A0(0x0038)
	uint32_t                                           Key;                                                      // 0x03D8(0x0004) (ZeroConstructor, IsPlainOldData)
	uint32_t                                           deliver_target_id;                                        // 0x03DC(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVehicleState                               vehicle_state;                                            // 0x03E0(0x0138)
	TArray<struct FVehicleState>                       nearby_vehicles;                                          // 0x0518(0x0010) (ZeroConstructor)
	struct FAIBulletHoles                              bullet_holes;                                             // 0x0528(0x0030)
	TArray<struct FAIRecipients>                       recipients;                                               // 0x0558(0x0010) (ZeroConstructor)
	TArray<struct FSpecialZoneState>                   special_zones;                                            // 0x0568(0x0010) (ZeroConstructor)
	TArray<struct FDynamicItem>                        dynamic_items;                                            // 0x0578(0x0010) (ZeroConstructor)
	uint32_t                                           ai_style;                                                 // 0x0588(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x058C(0x0004) MISSED OFFSET
	struct FAIStateConfig                              Config;                                                   // 0x0590(0x0018)
};

// ScriptStruct AI.DiffStateInfoInt32
// 0x0004
struct FDiffStateInfoInt32
{
	int                                                Value;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffStateInfoFloat
// 0x0004
struct FDiffStateInfoFloat
{
	float                                              Value;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffStateInfoVector
// 0x000C
struct FDiffStateInfoVector
{
	struct FDiffStateInfoFloat                         X;                                                        // 0x0000(0x0004)
	struct FDiffStateInfoFloat                         Y;                                                        // 0x0004(0x0004)
	struct FDiffStateInfoFloat                         Z;                                                        // 0x0008(0x0004)
};

// ScriptStruct AI.DiffStateInfoBool
// 0x0001
struct FDiffStateInfoBool
{
	bool                                               Value;                                                    // 0x0000(0x0001) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffAttribute
// 0x0008
struct FDiffAttribute
{
	uint32_t                                           ID;                                                       // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoFloat                         Value;                                                    // 0x0004(0x0004)
};

// ScriptStruct AI.DiffAIAttributes
// 0x0020 (0x0030 - 0x0010)
struct FDiffAIAttributes : public FDiffStateInfoBase
{
	TArray<struct FDiffAttribute>                      attribute_state;                                          // 0x0010(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   item_state;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffAIPlayerState
// 0x00B8 (0x00D0 - 0x0018)
struct FDiffAIPlayerState : public FUniqueStateInfo
{
	uint32_t                                           ID;                                                       // 0x0018(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoInt32                         actor_id;                                                 // 0x001C(0x0004)
	struct FDiffStateInfoInt32                         team_id;                                                  // 0x0020(0x0004)
	struct FDiffStateInfoVector                        Position;                                                 // 0x0024(0x000C)
	struct FDiffStateInfoVector                        Rotation;                                                 // 0x0030(0x000C)
	struct FDiffStateInfoVector                        Speed;                                                    // 0x003C(0x000C)
	struct FDiffStateInfoFloat                         HP;                                                       // 0x0048(0x0004)
	struct FDiffStateInfoFloat                         Energy;                                                   // 0x004C(0x0004)
	struct FDiffStateInfoFloat                         dying_hp;                                                 // 0x0050(0x0004)
	struct FDiffStateInfoFloat                         oxygen;                                                   // 0x0054(0x0004)
	struct FDiffStateInfoInt32                         active_weapon_slot;                                       // 0x0058(0x0004)
	struct FDiffStateInfoInt32                         weapon_status;                                            // 0x005C(0x0004)
	struct FDiffStateInfoBool                          is_switching;                                             // 0x0060(0x0001)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0061(0x0003) MISSED OFFSET
	struct FDiffStateInfoInt32                         alive_state;                                              // 0x0064(0x0004)
	struct FDiffStateInfoInt32                         kill_count;                                               // 0x0068(0x0004)
	struct FDiffStateInfoInt32                         Damages;                                                  // 0x006C(0x0004)
	struct FDiffStateInfoBool                          is_running;                                               // 0x0070(0x0001)
	struct FDiffStateInfoBool                          is_aiming;                                                // 0x0071(0x0001)
	struct FDiffStateInfoBool                          is_left_probe;                                            // 0x0072(0x0001)
	struct FDiffStateInfoBool                          is_right_probe;                                           // 0x0073(0x0001)
	struct FDiffStateInfoBool                          is_floating;                                              // 0x0074(0x0001)
	struct FDiffStateInfoBool                          is_diving;                                                // 0x0075(0x0001)
	struct FDiffStateInfoBool                          is_vehicle_probe;                                         // 0x0076(0x0001)
	struct FDiffStateInfoBool                          is_in_vehicle;                                            // 0x0077(0x0001)
	struct FDiffStateInfoBool                          is_firing;                                                // 0x0078(0x0001)
	struct FDiffStateInfoBool                          is_using_skill;                                           // 0x0079(0x0001)
	struct FDiffStateInfoBool                          is_holding;                                               // 0x007A(0x0001)
	struct FDiffStateInfoBool                          is_stun;                                                  // 0x007B(0x0001)
	struct FDiffStateInfoBool                          is_pose_acting;                                           // 0x007C(0x0001)
	struct FDiffStateInfoBool                          is_picking;                                               // 0x007D(0x0001)
	unsigned char                                      UnknownData01[0x2];                                       // 0x007E(0x0002) MISSED OFFSET
	struct FDiffStateInfoInt32                         body_state;                                               // 0x0080(0x0004)
	struct FDiffStateInfoInt32                         location_state;                                           // 0x0084(0x0004)
	struct FDiffStateInfoBool                          has_smoke;                                                // 0x0088(0x0001)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0089(0x0003) MISSED OFFSET
	struct FDiffStateInfoInt32                         vehicle_role;                                             // 0x008C(0x0004)
	struct FDiffStateInfoInt32                         player_type;                                              // 0x0090(0x0004)
	struct FDiffStateInfoInt32                         revival_count;                                            // 0x0094(0x0004)
	struct FDiffAIAttributes                           Attributes;                                               // 0x0098(0x0030)
	struct FDiffStateInfoInt32                         using_skill_id;                                           // 0x00C8(0x0004)
	unsigned char                                      UnknownData03[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DiffCameraState
// 0x0028 (0x0038 - 0x0010)
struct FDiffCameraState : public FDiffStateInfoBase
{
	struct FDiffStateInfoVector                        Position;                                                 // 0x0010(0x000C)
	struct FDiffStateInfoVector                        Rotation;                                                 // 0x001C(0x000C)
	struct FDiffStateInfoVector                        view_position;                                            // 0x0028(0x000C)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DiffAIWeaponStateInfo
// 0x0028 (0x0038 - 0x0010)
struct FDiffAIWeaponStateInfo : public FDiffStateInfoBase
{
	uint32_t                                           slot_id;                                                  // 0x0010(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoInt32                         Category;                                                 // 0x0014(0x0004)
	struct FDiffStateInfoInt32                         Type;                                                     // 0x0018(0x0004)
	struct FDiffStateInfoInt32                         Bullet;                                                   // 0x001C(0x0004)
	struct FDiffStateInfoFloat                         remain_reloading;                                         // 0x0020(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
	TArray<int>                                        attachments;                                              // 0x0028(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffAIPlayerWeapon
// 0x0020 (0x0030 - 0x0010)
struct FDiffAIPlayerWeapon : public FDiffStateInfoBase
{
	TArray<struct FDiffAIWeaponStateInfo>              player_weapon;                                            // 0x0010(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   item_state;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffStateInfoUInt32
// 0x0004
struct FDiffStateInfoUInt32
{
	uint32_t                                           Value;                                                    // 0x0000(0x0004) (ZeroConstructor, IsPlainOldData)
};

// ScriptStruct AI.DiffAIBackpackItem
// 0x0010 (0x0020 - 0x0010)
struct FDiffAIBackpackItem : public FDiffStateInfoBase
{
	struct FDiffStateInfoInt32                         Category;                                                 // 0x0010(0x0004)
	uint32_t                                           ID;                                                       // 0x0014(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoUInt32                        Count;                                                    // 0x0018(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x001C(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DiffPlayerBackpack
// 0x0020 (0x0030 - 0x0010)
struct FDiffPlayerBackpack : public FDiffStateInfoBase
{
	TArray<struct FDiffAIBackpackItem>                 backpack_item;                                            // 0x0010(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   item_state;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffAIEquipmentInfo
// 0x0010 (0x0028 - 0x0018)
struct FDiffAIEquipmentInfo : public FUniqueStateInfo
{
	struct FDiffStateInfoInt32                         Category;                                                 // 0x0018(0x0004)
	uint32_t                                           ID;                                                       // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoFloat                         Durability;                                               // 0x0020(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0024(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DiffAIPlayerEquipment
// 0x0020 (0x0030 - 0x0010)
struct FDiffAIPlayerEquipment : public FDiffStateInfoBase
{
	TArray<struct FDiffAIEquipmentInfo>                equipment_item;                                           // 0x0010(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   item_state;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffProgressBarState
// 0x0008 (0x0018 - 0x0010)
struct FDiffProgressBarState : public FDiffStateInfoBase
{
	struct FDiffStateInfoInt32                         Type;                                                     // 0x0010(0x0004)
	struct FDiffStateInfoFloat                         remain_time;                                              // 0x0014(0x0004)
};

// ScriptStruct AI.DiffAINearbyPlayer
// 0x0130 (0x0140 - 0x0010)
struct FDiffAINearbyPlayer : public FDiffStateInfoBase
{
	struct FDiffAIPlayerState                          State;                                                    // 0x0010(0x00D0)
	struct FDiffAIPlayerWeapon                         Weapon;                                                   // 0x00E0(0x0030)
	struct FDiffAIPlayerEquipment                      equipment;                                                // 0x0110(0x0030)
};

// ScriptStruct AI.DiffAINearbyPlayers
// 0x0020 (0x0030 - 0x0010)
struct FDiffAINearbyPlayers : public FDiffStateInfoBase
{
	TArray<struct FDiffAINearbyPlayer>                 Players;                                                  // 0x0010(0x0010) (ZeroConstructor)
	TArray<uint32_t>                                   item_state;                                               // 0x0020(0x0010) (ZeroConstructor)
};

// ScriptStruct AI.DiffItemStateData
// 0x0028 (0x0038 - 0x0010)
struct FDiffItemStateData : public FDiffStateInfoBase
{
	struct FDiffStateInfoInt32                         Type;                                                     // 0x0010(0x0004)
	struct FDiffStateInfoInt32                         Category;                                                 // 0x0014(0x0004)
	struct FDiffStateInfoUInt32                        ID;                                                       // 0x0018(0x0004)
	int                                                UID;                                                      // 0x001C(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FDiffStateInfoVector                        Position;                                                 // 0x0020(0x000C)
	struct FDiffStateInfoFloat                         Durability;                                               // 0x002C(0x0004)
	struct FDiffStateInfoUInt32                        player_id;                                                // 0x0030(0x0004)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET
};

// ScriptStruct AI.DiffItemStateDatas
// 0x0020 (0x0030 - 0x0010)
struct FDiffItemStateDatas : public FDiffStateInfoBase
{
	TArray<struct FDiffItemStateData>                  Items;                                                    // 0x0010(0x0010) (ZeroConstructor)
